# Pandas Library

In [1]:
import pandas as pd

In [2]:
s1=pd.Series([1,2,3,4,5])

In [3]:
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
type(s1)

pandas.core.series.Series

In [5]:
# 2. Changing Index

In [6]:
s1=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])

In [7]:
s1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [8]:
# 3. Series object with dictionary

In [9]:
s2=pd.Series({'k1':10,'k2':20,'k3':30})

In [10]:
s2

k1    10
k2    20
k3    30
dtype: int64

In [11]:
# 4. changing index position

In [12]:
s3=pd.Series({'k1':10,'k2':20,'k3':30},index=['k3','k1','k4','k2'])

In [13]:
s3

k3    30.0
k1    10.0
k4     NaN
k2    20.0
dtype: float64

In [14]:
# 5. Extracting Individual Elements

In [15]:
l1 = [1,2,3,4,5,6,7,8,9]

In [16]:
s1=pd.Series(l1)

In [17]:
s1

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [18]:
s1[4]

5

In [19]:
s1[:6]

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [20]:
s1[-3:]

6    7
7    8
8    9
dtype: int64

In [21]:
# 6. Basic math operation on series

In [22]:
s1

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [23]:
#adding scalar value
s1+10

0    11
1    12
2    13
3    14
4    15
5    16
6    17
7    18
8    19
dtype: int64

In [24]:
# subtracting scalar value
s1-10

0   -9
1   -8
2   -7
3   -6
4   -5
5   -4
6   -3
7   -2
8   -1
dtype: int64

In [25]:
# Multiplication scalar value
s1*2

0     2
1     4
2     6
3     8
4    10
5    12
6    14
7    16
8    18
dtype: int64

In [26]:
# Dividing scalar value
s1/2

0    0.5
1    1.0
2    1.5
3    2.0
4    2.5
5    3.0
6    3.5
7    4.0
8    4.5
dtype: float64

In [27]:
# Adding two series object
s1=pd.Series([1,2,3,4,5,6,7,8,9])
s2=pd.Series([10,20,30,40,50,60,70,80,90])
s1+s2

0    11
1    22
2    33
3    44
4    55
5    66
6    77
7    88
8    99
dtype: int64

In [28]:
# 7. Python Dataframe

In [29]:
# creating data frame
pd.DataFrame({'Name':['Anand','guru','Shivam'],'Marks':[75,92,85]})

     Name  Marks
0   Anand     75
1    guru     92
2  Shivam     85

In [30]:
# 8. Working With Excel File using Pandas

In [31]:
nme = ["aparna", "pankaj", "sudhir", "Geeku"]
deg = ["MBA", "BCA", "M.Tech", "MBA"]
scr = [90, 40, 80, 98]
# dictionary of list 
dict = {'name': nme, 'degree': deg, 'score': scr}
df = pd.DataFrame(dict)
# saving the dataframe
df.to_csv('file1.csv')

In [32]:
# 9. Saving CSV without headers and index.
# list of name, degree, score
nme = ["aparna", "pankaj", "sudhir", "Geeku"]
deg = ["MBA", "BCA", "M.Tech", "MBA"]
scr = [90, 40, 80, 98]
# dictionary of lists
dict = {'name': nme, 'degree': deg, 'score': scr}
df = pd.DataFrame(dict)
# saving the dataframe
df.to_csv('file2.csv', header=False, index=False)

In [33]:
#10. Save csv file to a specified location.

# list of name, degree, score
nme = ["aparna", "pankaj", "sudhir", "Geeku"]
deg = ["MBA", "BCA", "M.Tech", "MBA"]
scr = [90, 40, 80, 98]
# dictionary of lists
dict = {'name': nme, 'degree': deg, 'score': scr}
df = pd.DataFrame(dict)
# saving the dataframe
df.to_csv(r'E:\Python Tutorial\file3.csv', index=False)

In [34]:
# 11. Read CSV File
# Using the function to load
# the data of example.csv
# into a Dataframe df
df = pd.read_csv('student_data.csv')
# Print the Dataframe
df

      PRN    NAME  COURSE BRANCH SESSION  10th Marks  12th Marks  Total Fee
0   SUS52   Anand  B.Tech    CSE   19-23         368         337      75000
1   SUS13   Megha  B.Tech    CSE   19-23         430         355      70000
2   SUS59  Shivam  B.Tech    CSE   19-23         322         312      70000
3   SUS56    Arti  B.Tech    CSE   19-23         411         399      70000
4   SUS32    Guru  B.Tech    CSE   19-23         370         403      70000
5   SUS44  Ritesh     BCA     IT   19-22         305         345      55000
6   SUS11  Deepak     BCA     IT   20-23         302         310      55000
7  SUS172  Aryant  B.Tech     ME   19-23         255         268      70000

In [41]:
# 12. Pandas Functions: head(),tail(),shape(),describe()

In [42]:
import pandas as pd

In [43]:
df = pd.read_csv('student_data.csv')

In [44]:
df.head()

     PRN    NAME  COURSE BRANCH SESSION  10th Marks  12th Marks  Total Fee
0  SUS52   Anand  B.Tech    CSE   19-23         368         337      75000
1  SUS13   Megha  B.Tech    CSE   19-23         430         355      70000
2  SUS59  Shivam  B.Tech    CSE   19-23         322         312      70000
3  SUS56    Arti  B.Tech    CSE   19-23         411         399      70000
4  SUS32    Guru  B.Tech    CSE   19-23         370         403      70000

In [45]:
df.tail()

      PRN    NAME  COURSE BRANCH SESSION  10th Marks  12th Marks  Total Fee
3   SUS56    Arti  B.Tech    CSE   19-23         411         399      70000
4   SUS32    Guru  B.Tech    CSE   19-23         370         403      70000
5   SUS44  Ritesh     BCA     IT   19-22         305         345      55000
6   SUS11  Deepak     BCA     IT   20-23         302         310      55000
7  SUS172  Aryant  B.Tech     ME   19-23         255         268      70000

In [46]:
df.shape

(8, 8)

In [47]:
df.describe()

       10th Marks  12th Marks     Total Fee
count    8.000000    8.000000      8.000000
mean   345.375000  341.125000  66875.000000
std     59.536153   45.617783   7529.703087
min    255.000000  268.000000  55000.000000
25%    304.250000  311.500000  66250.000000
50%    345.000000  341.000000  70000.000000
75%    380.250000  366.000000  70000.000000
max    430.000000  403.000000  75000.000000

In [48]:
# 13. .iloc[]

In [49]:
df

      PRN    NAME  COURSE BRANCH SESSION  10th Marks  12th Marks  Total Fee
0   SUS52   Anand  B.Tech    CSE   19-23         368         337      75000
1   SUS13   Megha  B.Tech    CSE   19-23         430         355      70000
2   SUS59  Shivam  B.Tech    CSE   19-23         322         312      70000
3   SUS56    Arti  B.Tech    CSE   19-23         411         399      70000
4   SUS32    Guru  B.Tech    CSE   19-23         370         403      70000
5   SUS44  Ritesh     BCA     IT   19-22         305         345      55000
6   SUS11  Deepak     BCA     IT   20-23         302         310      55000
7  SUS172  Aryant  B.Tech     ME   19-23         255         268      70000

In [50]:
df.iloc[2:6,5:8]

   10th Marks  12th Marks  Total Fee
2         322         312      70000
3         411         399      70000
4         370         403      70000
5         305         345      55000

In [51]:
# 14. .loc[]

In [52]:
df.loc[2:5,("10th Marks","12th Marks")]

   10th Marks  12th Marks
2         322         312
3         411         399
4         370         403
5         305         345

In [53]:
# 15. Dropping Columns

In [54]:
df.drop('Total Fee',axis=1)

      PRN    NAME  COURSE BRANCH SESSION  10th Marks  12th Marks
0   SUS52   Anand  B.Tech    CSE   19-23         368         337
1   SUS13   Megha  B.Tech    CSE   19-23         430         355
2   SUS59  Shivam  B.Tech    CSE   19-23         322         312
3   SUS56    Arti  B.Tech    CSE   19-23         411         399
4   SUS32    Guru  B.Tech    CSE   19-23         370         403
5   SUS44  Ritesh     BCA     IT   19-22         305         345
6   SUS11  Deepak     BCA     IT   20-23         302         310
7  SUS172  Aryant  B.Tech     ME   19-23         255         268

In [55]:
# 16. Dropping row

In [56]:
df.drop([3,4,5],axis=0)

      PRN    NAME  COURSE BRANCH SESSION  10th Marks  12th Marks  Total Fee
0   SUS52   Anand  B.Tech    CSE   19-23         368         337      75000
1   SUS13   Megha  B.Tech    CSE   19-23         430         355      70000
2   SUS59  Shivam  B.Tech    CSE   19-23         322         312      70000
6   SUS11  Deepak     BCA     IT   20-23         302         310      55000
7  SUS172  Aryant  B.Tech     ME   19-23         255         268      70000

In [57]:
# 17. More pandas Functions

In [58]:
mf = pd.read_csv('student_marks.csv')

In [59]:
mf

    C  C++  Java  Python   Database  DSA  Total Marks
0  85   62    65       98        85   45          440
1  65   45    92       52        74   69          397
2  88   92    74       41        32   20          347
3  65   14    41       47        85   49          301
4  85   97    45       32        56   45          360
5  35   42    45       74        85   14          295

In [60]:
# min function
mf.min()

C               35
C++             14
Java            41
Python          32
Database        32
DSA             14
Total Marks    295
dtype: int64

In [61]:
# max function
mf.max()

C               88
C++             97
Java            92
Python          98
Database        85
DSA             69
Total Marks    440
dtype: int64

In [62]:
#mean function
mf.mean()

C               70.500000
C++             58.666667
Java            60.333333
Python          57.333333
Database        69.500000
DSA             40.333333
Total Marks    356.666667
dtype: float64

In [63]:
#median function
mf.median()

C               75.0
C++             53.5
Java            55.0
Python          49.5
Database        79.5
DSA             45.0
Total Marks    353.5
dtype: float64

In [64]:
mf

    C  C++  Java  Python   Database  DSA  Total Marks
0  85   62    65       98        85   45          440
1  65   45    92       52        74   69          397
2  88   92    74       41        32   20          347
3  65   14    41       47        85   49          301
4  85   97    45       32        56   45          360
5  35   42    45       74        85   14          295

In [65]:
# half method
def half(s):
    return s*0.5

In [66]:
mf[['Java','Database']].apply(half)

   Java  Database
0  32.5      42.5
1  46.0      37.0
2  37.0      16.0
3  20.5      42.5
4  22.5      28.0
5  22.5      42.5

In [67]:
# 18. value_counts

In [68]:
mf["Total Marks"].value_counts()

440    1
397    1
347    1
301    1
360    1
295    1
Name: Total Marks, dtype: int64

In [69]:
mf["C"].value_counts()

85    2
65    2
88    1
35    1
Name: C, dtype: int64

In [70]:
# sort_values

In [71]:
mf.sort_values(by="Total Marks")

    C  C++  Java  Python   Database  DSA  Total Marks
5  35   42    45       74        85   14          295
3  65   14    41       47        85   49          301
2  88   92    74       41        32   20          347
4  85   97    45       32        56   45          360
1  65   45    92       52        74   69          397
0  85   62    65       98        85   45          440